Revit 2016 API
Document.NewPointLoad Method
Creates a new point load within the project.
Overload List
Name | Description
NewPointLoad(Reference, XYZ, XYZ, Boolean, PointLoadType, SketchPlane) |  Obsolete.
Creates a new hosted point load within the project.
NewPointLoad(XYZ, XYZ, XYZ, Boolean, PointLoadType, SketchPlane) |  Obsolete.
Creates a new unhosted point load within the project.
See Also
Document Class
Document Members
Autodesk.Revit.Creation Namespace